Repository: Organice/django-organice
Catalog: docs/locale/*/LC_MESSAGES/alternatives.po
Languages: de

source: Alternatives to django Organice
de: Alternativen zu django Organice

source: With django Organice we strive to make people happy who are not tech or process experts. People who want to collaborate smoothly without having taken part of extensive training programmes in order to understand the tool. Simplicity is key, everything should be intuitive, getting things done easily. Occasional users should be happy to the same extent than daily-habit expert users.
de: Mit django Organice versuchen wir Menschen glücklich zu machen, die keine Technik- oder Prozessexperten sind. Menschen, die einfach und unkompliziert zusammenarbeiten wollen, ohne vorher an umfangreichen Schulungen teilgenommen zu haben, nur um das Arbeitsinstrument zu verstehen. Einfachheit ist der Schlüssel, alles soll selbsterklärend sein, damit die Arbeit leicht von der Hand geht. Dabei sollen gelegentliche Nutzer genauso glücklich werden wie Experten, die die Plattform täglich nutzen.

source: But of course, django Organice doesn't fit it all. If you feel it can't satisfy your specific needs it may be a good idea to look at the following alternatives. If you happen to know additional offers `drop us a note`_ so we can make the list more complete.
de: Natürlich kann django Organice nicht für alles die Lösung sein. Wenn Sie das Gefühl haben, Ihre speziellen Bedürfnisse kann es nicht befriedigen, könnte es sich auszahlen, einen Blick auf die uns bekannten Alternativen zu werfen. Falls Sie weitere Angebote kennen, `geben Sie uns Bescheid`_, damit wir diese Liste sinnvoll ergänzen können.

source: Software Alternatives
de: Software-Alternativen

source: In alphabetical order.
de: In alphabetischer Reihenfolge.

source: `Bitrix Intranet`_ (PHP, commercial, ships with source code)
de: `Bitrix Intranet`_ (PHP, kommerziell, wird mit Quellcode geliefert)

source: Coyo_ (Java/Play, commercial, ships with source code)
de: Coyo_ (Java/Play, kommerziell, wird mit Quellcode geliefert)

source: Fairgate_ (PHP, commercial, Switzerland only)
de: Fairgate_ (PHP, kommerziell, nur Schweiz)

source: `Microsoft SharePoint + Yammer`_ [1]_ (.NET + Rails, commercial)
de: `Microsoft SharePoint + Yammer`_ [1]_ (.NET + Rails, kommerziell)

source: Cloud Competitors
de: Cloud-Mitbewerber
