Repository: Organice/django-organice
Catalog: docs/locale/*/LC_MESSAGES/changelog.po
Languages: de

source: Disabled Mediatree component (needs upgrade to Python 3) -- *planned for v0.4*
de: Mediatree-Komponente deaktiviert (muss auf Python 3 upgegraded werden) -- *geplant für v0.4*

source: Disabled Newsletter component (needs upgrade to Python 3) -- *planned for v0.4*
de: Newsletter-Komponente deaktiviert (muss auf Python 3 upgegraded werden) -- *geplant für v0.4*

source: Added Python 3 support
de: Python 3 Unterstützung hinzugefügt

source: Switched from develop/master model to feature branching model (default branch: ``master``)
de: Umstellung von develop/master Modell auf feature-Branching Modell (Standard-Branch: ``master``)

source: Migrated project to Django 1.8.8 and django CMS 3.2
de: Migration des Projekts auf Django 1.8.8 und django CMS 3.2

source: Added sample content loading (first using fixtures, later converted to management command)
de: Beispiel-Inhalte zum Laden hinzugefügt (zuerst via Fixtures, später umgestellt auf Management Commands)

source: Integration of Piwik open source analytics (optional via django-analytical)
de: Integration von Piwik open source analytics (optional mit django-analytical)

source: Added some test coverage, finally!
de: Testabdeckung bereitgestellt, endlich!

source: Started with continuous builds (Travis-CI, Shippable)
de: Start von Continuous Builds (Travis-CI, Shippable)

source: Project-level Makefile
de: Makefile auf Projektebene

source: Automation of translation processes with Transifex (for documentation only)
de: Automatisierung des Übersetzungsprozesses mit Transifex (nur für die Dokumentation)

source: New options for settings (``ORGANICE_URL_PATH_``...)
de: Neue Einstellungsoptionen (``ORGANICE_URL_PATH_``...)

source: Newsletter editor configuration, newsletter template sample
de: Newsletter Editor-Konfiguration, Newsletter Vorlage-Beispiel

source: Added social login and user profiles (django-allauth)
de: Social Login und Benutzerprofile hinzugefügt (django-allauth)

source: Added assets pipeline (bootstrap-sass, Compass, UglifyJS v2)
de: Web Assets Pipeline hinzugefügt (bootstrap-sass, Compass, UglifyJS v2)

source: Upgraded jQuery to v1.11.0, template overhaul with Bootstrap
de: jQuery auf v1.11.0 aktualisiert, Vorlagen mit Bootstrap neu überholt

source: Added language selection dropdown menu
de: Sprachauswahl Dropdown-Menü hinzugefügt

source: Migrated theme data (templates, styles, and javascript) and assets pipeline to separate projects
de: Daten von Website-Themes (Vorlagen, Styles und JavaScript) und Web Assets Pipeline in separate Projekte ausgelagert

source: Generation of server configuration (lighttpd) and more options in organice-setup
de: Generieren der Serverkonfiguration (lighttpd) und weiterer Optionen in organice-setup

source: Added media management (django-media-tree)
de: Medien-Management hinzugefügt (django-media-tree)

source: Added todo lists (django-todo)
de: Todo-Listen hinzugefügt (django-todo)

source: Added generic analytics (django-analytical)
de: Generische Analytics-Integration hinzugefügt (django-analytical)

source: Initial release
de: Erstausgabe

source: Based on Django 1.5.5, django CMS 2.4.3, Zinnia blog 0.13, Emencia newsletter 0.3.dev
de: Basierend auf Django 1.5.5, django CMS 2.4.3, Zinnia blog 0.13, Emencia newsletter 0.3.dev

source: A more natural i18n mechanism than vanilla Django, no language prefix for default language
de: Natürlicherer i18n-Mechanismus als der in Django eingebaute, ohne Sprachen-Präfix für die Standardsprache

source: Setup script with project generation, deployment settings, custom templates, Bootstrap 3
de: Setup-Skript mit Projektgenerierung, Deployment-Einstellungen, individuelle Vorlagen, Bootstrap 3
