Repository: Organice/django-organice
Catalog: docs/locale/*/LC_MESSAGES/components.po
Languages: de

source: User Manual
de: Benutzerhandbuch

source: django Organice is composed of the following main components:
de: django Organice besteht aus den folgenden Hauptkomponenten:

source: Editing your website is not much different from surfing the web. When you're logged in to your website you will have the django CMS toolbar on top of the page. Press the blue "Edit" button to go into Edit mode. When you now hover over the website elements you'll notice tooltips ("Double-click to edit"). Double-click on those areas, and an editor window will open up to allow you to modify the content.
de: Das Bearbeiten Ihrer Website unterscheidet sich nicht wesentlich vom Surfen im Internet. Wenn Sie auf Ihrer Website eingeloggt sind, haben Sie am oberen Rand der Seite die CMS-Werkzeugleiste zur Verfügung. Klicken Sie auf die Schaltfläche "Bearbeiten", um in den Bearbeiten-Modus zu wechseln. Wenn Sie nun über die Website-Elemente fahren, bemerken Sie Tooltips ("Doppelklicken zum Bearbeiten"). Doppelklicken Sie auf diesen Bereichen und ein Editor-Fenster öffnet sich, um den Inhalt zu bearbeiten.

source: You can safely modify content on the page without the website to change. Only you can see the changes, and only as long as you are in Edit mode. When you're happy with the changes press the blue "Publish changes" button on the django CMS toolbar to make your version visible to the world.
de: Sie können seelenruhig Inhalte der Seite verändern, ohne dass sich die Website im Internet verändert. Nur Sie können die Änderungen sehen, und nur so lange Sie im Bearbeitungsmodus sind. Wenn Sie mit den Änderungen glücklich sind, drücken Sie auf die blaue "Änderungen veröffentlichen"-Schaltfläche auf der django CMS Werkzeugleiste und Ihre Version wird auch für andere sichtbar.

source: For more technical tasks like creating a navigation structure, adding pages, etc. the django CMS toolbar redirects you to the Django administration interface. Want to have an upfront first impression before using it? Check out the (slightly outdated) django CMS `video on frontend-editing`_.
de: Für technischere Aufgaben, wie z.B. das Erstellen einer Navigationsstruktur, das Hinzufügen von Seiten, usw., leitet Sie die django CMS Werkzeugleiste auf die Django Administrationsoberfläche weiter. Brauchen Sie ein paar Eindrücke vorab, bevor Sie das System zum ersten Mal benutzen? Sehen Sie sich das (etwas in die Jahre gekommene) django CMS `video on frontend-editing`_ an.

source: Writing and publishing interesting articles now and then is called "blogging". It's very similar to the usual editing of your website, but still it's different because you get more features as a natural add-on: Categories, tagging, comments, publication dates, archives (yearly, monthly, daily), related entries, RSS feeds, etc.
de: Interessante Artikel hie und da zu schreiben und zu veröffentlichen nennt man "Blogging". Es ist dem üblichen Bearbeiten der Website sehr ähnlich, dennoch unterscheidet es sich aufgrund der zahlreichen Features, die man quasi automatisch dazubekommt: Kategorien, Etiketten, Kommentare, Veröffentlichungsdatum, Archive (jährlich, monatlich, täglich), verwandte Einträge, RSS-Feeds, usw.

source: On your website you simply go to the Blog area, and click on the "Add" link, which is available when you're logged in. In the blog entry editor you have all functionality you already know from the content management section. Modifying existing blog entries works identical to the usual content changes on your website with the exception of publishing, which is not available with an intermediate draft step: All your changes are immediately visible online.
de: Auf Ihrer Website gehen Sie einfach auf den Blog-Bereich und klicken dann auf die "Hinzufügen"-Schaltfläche, die verfügbar ist, wenn Sie eingeloggt sind. Im Blog-Eintrag-Editor haben Sie die gesamte Funktionsvielfalt zur Verfügung, die Sie bereits aus dem Content Management-Bereich kennen. Bestehende Blog-Einträge bearbeiten funktioniert genauso wie das übliche Überarbeiten Ihrer Website mit der Ausnahme des Veröffentlichens, mit dem ansonsten ein Entwurf als Zwischenschritt zur Verfügung steht: Alle gespeicherten Änderungen sind sofort online sichtbar.

source: Note that in django Organice we also use the blog functionality for other use cases that are very similar to the usual blogging, such as event agendas, job postings, press releases, download lists, etc.
de: Merke: In django Organice wird die Blog-Funktionalität auch für Anwendungsfälle genutzt, die dem üblichen Bloggen sehr ähnlich sind, z.B. Veranstaltungskalender, Stellenausschreibungen, Pressemeldungen, Download-Listen, etc.

source: Sending out news or updates to a circle of friends or customers is managed by the Newsletter component, which is available from the Django administration interface when you're logged in to your website. Simply click on "Admin > Site Administration" on the django CMS toolbar, and go to the Newsletter section in Django administration.
de: Für das Aussenden von Neuigkeiten und Updates an einen Freundes- oder Kundenkreis steht die Newsletter-Komponente zur Verfügung, die in der Django Administrationsoberfläche bedient werden kann, wenn Sie auf der Website eingeloggt sind. Kicken Sie einfach auf "Admin > Seiten-Administration" in der django CMS Werkzeugleiste und navigieren Sie zum Newsletter-Bereich im Django-Admin.

source: This component has a couple of powerful features. It's best explained having you watch the interesting French `overview video`_ from the Emencia website.
de: Diese Komponente hat einige sehr mächtige Features. Am besten kann diese das interessante französische `overview video`_ auf der Emencia-Website erklären.
