Repository: Organice/django-organice
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: de

source: Contributing to django Organice
de: Bei django Organice mitarbeiten

source: Official repositories: (kept in sync)
de: Offizielle Repositories: (synchronisiert)

source: Fork any of the repositories, make your code changes or additions, and place a pull request.
de: Forken Sie eines der Repositories, machen Sie Ihre Änderungen oder fügen Sie neuen Code hinzu, und eröffnen Sie einen Pull Request.

source: How To Get Started
de: Wie fange ich an?

source: After cloning your own fork from Bitbucket or GitHub make sure you have created and activated a virtual environment for development, then run ``make develop`` to install packages that help you with your development tasks (tools for testing, translation, docs generation).
de: Nach dem Klonen Ihres eigenen Forks von Bitbucket oder GitHub stellen Sie sicher, dass Sie ein Virtual Environment für die Entwicklung erstellt und aktiviert haben, dann führen Sie ``make develop`` aus, um die Packages zu installieren, die Ihnen bei der Entwicklung helfen (Testwerkzeuge, Übersetzungstools, Dokumentationsgeneratoren).

source: Guidelines
de: Richtlinien

source: The primary interpreter target to develop against is **Python 3**. Ideally, use the highest one the `Django package`_ integrated into our project is compatible with (3.4, at the moment). All other supported Python versions are tested by the `integration server`_ as soon as you place the pull request. You can run tests locally before pushing using ``tox`` or ``setup.py test``, e.g. ::
de: Der primäre Ziel-Interpreter für die Entwicklung ist **Python 3**. Am besten verwenden Sie die höchste Versionsnummer, die mit dem in das Projekt integrierten `Django package`_ kompatibel ist (momentan 3.4). Alle anderen unterstützten Python-Versionen werden vom `integration server`_ getestet, sobald Sie einen Pull Request eröffnen. Sie können Tests mittels ``tox`` oder ``setup.py test`` lokal ausführen, bevor Sie pushen, z.B. ::

source: Source code is supposed to satisfy ``flake8`` default rules (with the exception of line length, which can be up to 120 characters long). A pre-commit hook for Git is installed automatically for your convenience when you run ``make develop``, so you shouldn't even be able to commit when ``flake8`` is not passing. Additional static analysis is conducted by the `QA server`_, and you should make sure that code health goes up (or stays the same) with each contribution.
de: Der Quellcode soll die ``flake8`` Standardregeln erfüllen (mit Ausnahme der Zeilenlänge, die bis zu 120 Zeichen betragen darf). Ein pre-commit hook für Git wird der Einfachheit halber automatisch installiert, wenn Sie ``make develop`` ausführen, somit sollte es nicht einmal möglich sein zu committen, wenn ``flake8`` nicht erfolgreich durchläuft. Zusätzliche statische Analyse wird am `QA server`_ durchgeführt und Sie sollten sicherstellen, dass dort der Gesundheitsindikator für den Quellcode mit jedem Beitrag nach oben geht (oder gleichbleibt).

source: Help Wanted
de: Unterstützung gesucht

source: Writing tests (unit tests, BDD tests)
de: Schreiben von Tests (Unit Tests, BDD-Tests)

source: New features on the roadmap (see README)
de: Neue Features auf der Roadmap (siehe README)

source: Translations (blog posts, documentation, user interface)
de: Übersetzungen (Blog-Einträge, Dokumentation, Benutzeroberfläche)

source: Translation
de: Übersetzung

source: Translation is done on `Transifex`_ for both the project text strings and the documentation.
de: Die Übersetzung wird sowohl für die Texte im Quellcode als auch die Dokumentation mit `Transifex`_ durchgeführt.

source: The multilingual documentation is written in `reStructuredText`_ syntax, and built using `Sphinx`_. As a `translator`:index: you can simply jump on `Transifex`:index: and get your hands dirty for your language. Some helpful background reading is available from `Read the Docs`_ and `Transifex support`_.
de: Die mehrsprachige Dokumentation ist in `reStructuredText`_ Syntax geschrieben und wird mit `Sphinx`_ gebaut. Als `Übersetzer`:index: können Sie einfach auf `Transifex`:index: gehen und anfangen, sich für Ihre Sprache ins Zeug zu legen. Einige hilfreiche Hintergrundinformationen gibt es auf `Read the Docs`_ und im `Transifex support`_ zu lesen.

source: Bumping Versions, Package, Release
de: Versionen erstellen, Packaging, Releases

source: As for the `version numbers`:index: of django Organice we use `Semantic Versioning`_. Changes from one to the next `release`:index: are documented in the :doc:`changelog`.
de: Hinsichtlich der `Versionsnummern`:index: von django Organice verwenden wir `Semantic Versioning`_. Änderungen von einem zum nächsten `Release`:index: werden im :doc:`changelog` dokumentiert.
