Repository: Organice/django-organice
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: de

source: This document assumes you are familiar with basic Python and Django development and their `tools`_. If not, please read up on `pip`_, `virtualenv`_, and `virtualenvwrapper`_ first. A basic understanding is sufficient.
de: Dieses Dokument setzt voraus, dass Sie grundsätzlich mit der Entwicklung und den `tools`_ von Python und Django vertraut sind. Falls nein, lesen Sie bitte zuerst `pip`_, `virtualenv`_ und `virtualenvwrapper`_. Ein einfaches Verständnis davon ist ausreichend.

source: `Requirements`:index:
de: `Voraussetzungen`:index:

source: Python 2.7, 3.3, or 3.4
de: Python 2.7, 3.3 oder 3.4

source: All other `dependencies`:index: are resolved by the django Organice installer. Most of those dependencies are intentionally not pinned on their version number to allow a liberal upgrade path. This means you will get more up-to-date packages installed, but they may break your setup or not install at all.
de: Alle anderen `Abhängigkeiten`:index: werden durch den django Organice Installer aufgelöst. Die meisten dieser Abhängigkeiten sind bewusst nicht auf ihre Versionsnummer gepinned, um einen liberalen Upgrade-Pfad zu erlauben. Das bedeutet, Sie bekommen aktuellere Pakete installiert, aber diese brechen u.U. Ihr Setup oder installieren selbst gar nicht.

source: Confirmed, working dependencies are documented in the :doc:`changelog` for each release. If anything goes wrong during the installation described below try installing those requirements in your virtual environment *before* you install ``django-organice``::
de: Bestätigte, funktionierende Abhängigkeiten sind im :doc:`changelog` für jedes Release dokumentiert. Falls irgendetwas während der unten beschriebenen Installation schiefläuft, versuchen Sie diese requirements in Ihrem Virtual Environment zu installieren, *bevor* Sie ``django-organice`` installieren.

source: Recommended for installation
de: Für die Installation empfohlen

source: Installing django Organice
de: django Organice installieren

source: We recommend preparing a `virtual environment`:index: for running django Organice::
de: Wir empfehlen, ein `Virtual Environment`:index: für den Betrieb von django Organice anzulegen::

source: The prompt will change to something like ``(example)~$`` to reflect that your new virtual environment is active.
de: Die Eingabeaufforderung verändert sich in etwas wie ``(example)~$``, um anzuzeigen, dass Ihr neues Virtual Environment aktiv ist.

source: The easiest way is using ``pip`` for installation::
de: Am einfachsten klappt die Installation mit ``pip``::

source: This will pull the latest django Organice package from the Internet and `install`:index: all dependencies automatically.
de: Damit wird das neueste django Organice-Paket aus dem Internet heruntergeladen und alle Abhängigkeiten automatisch `installiert`:index:.

source: If you're a developer you may want to run django Organice with the latest sources: (don't do this as a user) ::
de: Wenn Sie Entwickler sind, möchten Sie vielleicht den letzten Stand von django Organice als Quellcode ziehen: (tun Sie das nicht als einfacher Benutzer) ::

source: or, alternatively, using pip::
de: oder alternativ mit pip::

source: Install the adapter suitable for your `database`:index: (PostgreSQL ``psycopg2``, MySQL ``MySQL-python``, Oracle ``cx_Oracle``, `etc.`_), e.g. ::
de: Installieren Sie den Datenbankadapter, der zu Ihrer `Datenbank`:index: passt (PostgreSQL ``psycopg2``, MySQL ``MySQL-python``, Oracle ``cx_Oracle``, `etc.`_), z.B. ::

source: The Django project recommends PostgreSQL.
de: Das Django-Projekt empfiehlt PostgreSQL.

source: You can skip this step if you decide to use SQLite, e.g. for evaluation purposes.
de: Sie können diesen Schritt überspringen, wenn Sie SQLite verwenden möchten, z.B. zur Evaluierung von django Organice.

source: Run the Organice setup command to create your new project: (e.g. *example*) ::
de: Führen Sie den Organice Setup-Befehl zum Erstellen Ihres neuen Projektes aus: (z.B. *example*) ::

source: Edit your settings in ``example/settings/common.py``, ``example/settings/develop.py``, etc. See the `Django documentation`_ on settings if you're not familiar with it. The ``develop`` settings are used by your project by default (local development), ``common`` is included in all profiles.
de: Bearbeiten Sie Ihre settings in ``example/settings/common.py``, ``example/settings/develop.py``, etc. Ziehen Sie die `Django documentation`_ zu Rate, wenn Sie mit bestimmten settings nicht vertraut sind. Die ``develop`` settings werden von Ihrem Projekt standardmäßig benutzt (lokale Entwicklung), ``common`` wird in alle Profile eingebunden.

source: Initialize your database::
de: Initialisieren der Datenbank::

source: This will prepare the database and add some sample content. If you'd rather wish to start with a clean database run to ``migrate`` only instead::
de: Damit wird Ihre Datenbank vorbereitet und ein paar Beispiel-Inhalte eingepflegt. Wenn Sie bevorzugen, mit einer sauberen Datenbank zu starten, führen Sie stattdessen nur ``migrate``::

source: Start your Django project::
de: Ihr Django-Projekt starten::

source: You can now point your browser to http://127.0.0.1:8000/ and start developing your project locally.
de: Sie können mit Ihrem Web-Browser jetzt die Adresse http://127.0.0.1:8000/ öffnen und beginnen, Ihr Projekt lokal zu entwickeln.

source: If you're planning to create your content locally make sure you use the same database engine for local development and production. Your plan of moving the whole database content from development to production will give you major headaches otherwise. And, use Sqlite for evaluating only!
de: Wenn Sie vorhaben, Ihre Inhalte lokal zu erstellen, stellen Sie sicher, dass Sie die gleiche Datenbank-Engine für lokalen Entwicklung und Produktion verwenden. Ihr Plan, den gesamten Datenbankinhalt von der Entwicklungsumgebung in die Produktionsumgebung zu bewegen wird Ihnen sonst größere Kopfschmerzen bereiten. Und, verwenden Sie Sqlite nur zum Evaluieren!

source: Initial Configuration
de: Konfiguration zu Beginn

source: Follow the instructions given to you by the django Organice installer ``organice-setup`` after setup has completed. You have to adapt some values in your project settings!
de: Folgen Sie den Anweisungen des django Organice Installers ``organice-setup``, sobald das Setup abgeschlossen ist. Sie müssen ein paar Werte in Ihren Projekt-settings anpassen!

source: If you want your site to use a language other than English, or you want to use several languages: Adapt the values of :const:`LANGUAGE_CODE` and :const:`LANGUAGES`, and set :const:`USE_I18N = True` in your project settings.
de: Wenn Sie auf Ihrer Website eine andere Sprache als Englisch verwenden möchten oder wenn Sie mehrere Sprachen verwenden wollen: Passen Sie die Werte von :const:`LANGUAGE_CODE` und :const:`LANGUAGES` an und setzen Sie :const:`USE_I18N = True` in Ihren Projekt-settings.

source: After installation django Organice is configured, but unless you ran the ``bootstrap`` management command the database is blank without any content. You can add some sample content and other data running one or all of the following commands::
de: Nach der Installation ist django Organice konfiguriert, wenn Sie aber nicht den ``bootstrap`` Management Command ausgeführt haben, ist die Datenbank ohne Inhalte für Ihre Website. Sie können etwas an Beispiel-Inhalten und andere Daten hinzufügen, indem Sie einen oder alle der folgenden Befehle ausführen::

source: Alternatively, add your first pages, blog posts, and newsletter data manually:
de: Alternativ legen Sie Ihre ersten Seiten, Blog-Einträge und Newsletter-Daten händisch an:

source: Add some pages and navigation in the Django administration at Cms > Pages, and publish your changes.
de: Fügen Sie einige Seiten in der Django-Administration unter Cms > Pages hinzu und veröffentlichen Sie Ihre Änderungen.

source: Surf your new website, and fill your new pages with content using the front-end editing feature.
de: Gehen Sie auf Ihre neue Website und befüllen Sie Ihre neuen Seiten mit Inhalt, indem Sie das Front-end Editing-Feature verwenden.

source: Surf to ``/blog/`` on your website, and start adding Blog posts.
de: Gehen Sie zu ``/blog/`` auf Ihrer Website und legen Sie Blog-Einträge an.

source: Add a user in the Django administration at Newsletter > Contacts.
de: Fügen Sie in der Django Administration unter Newsletter > Contacts einen Benutzer hinzu.

source: Add ``localhost`` (or appropriate server) to Newsletter > SMTP servers.
de: Fügen Sie ``localhost`` (oder geeigneten Server) zu Newsletter > SMTP servers hinzu.

source: To allow subscribing from the website (from ``/newsletter/subscribe``) add a list to Newsletter > Mailing lists.
de: Um das Subscribe-Feature auf der Website zu aktivieren (von ``/newsletter/subscribe``), fügen Sie eine Liste zu Newsletter > Mailing lists hinzu.

source: Finally, add your first newsletter to Newsletter > Newsletters.
de: Erstellen Sie nun Ihren ersten Newsletter unter Newsletter > Newsletters.

source: For adding templates to Emencia Newsletter please consult the related section in the `TinyMCE 3.x documentation`_.
de: Um Vorlagen zu Emencia Newsletter hinzuzufügen, ziehen Sie bitte den diesbezüglichen Abschnitt in der `TinyMCE 3.x documentation`_ zu Rate.

source: For sending newsletters to work you must configure a cronjob polling on ``python manage.py send_newsletter`` every half an hour. If that was just Greek to you go ask your server admin for help. She knows!
de: Damit das Versenden von Newslettern funktioniert, müssen Sie einen cronjob konfigurieren, der auf ``python manage.py send_newsletter`` jede halbe Stunde pollt. Wenn das für Sie gerade Spanisch war, fragen Sie bitte Ihren Server Admin um Hilfe. Sie weiß garantiert Bescheid!

source: Deployment to Production
de: Deployment in Produktion

source: During the installation ``organice-setup`` prepared 3 different environments that help you with deployment::
de: Während der Installation hat ``organice-setup`` 3 unterschiedliche Umgebungen vorbereitet, die Ihnen beim Deployment helfen::

source: This modularized setup is described in Solution 2 of Tommy Jarnac's blog on `Django settings best practices`_ [1]_. The ``develop`` settings are active by default (for local development), ``common`` is included by all profiles.
de: Dieses modularisierte Setup ist in Lösung 2 von Tommy Jarnac's Blog-Eintrag zu `Django settings best practices`_ [1]_ beschrieben. Die ``develop`` settings sind standardmäßig aktiv (für lokale Entwicklung), ``common`` wird in alle Profile eingebunden.

source: For deployment to environments other than ``develop`` the settings module location must be overridden by setting the Django environment variable :const:`DJANGO_SETTINGS_MODULE`. For example, if you use Apache as your Django web server adapt your Apache configuration file for ``example`` with::
de: Für ein Deployment in alle Umgebungen ungleich ``develop`` muss das verwendete settings-Modul durch das Setzen der Django Umgebungsvariablen :const:`DJANGO_SETTINGS_MODULE` festgelegt werden. Zum Beispiel, wenn Sie Apache als Ihren Django Webserver verwenden, passen Sie Ihre Apache-Konfiguration für ``example`` an mit::

source: To test different settings locally you can start the Django webserver with the ``--settings`` option::
de: Um unterschiedliche settings lokal zu testen, können Sie den Django Webserver mit der ``--settings`` Option starten::

source: Finally, make sure you also have consulted the `deployment checklist`_ of the Django project and follow their best practices.
de: Zu guter Letzt, stellen Sie sicher, dass Sie die `deployment checklist`_ des Django-Projekts konsultiert haben und den beschriebenen Best Practices folgen.

source: David Cramer from DISQUS has described a similar solution at http://justcramer.com/2011/01/13/settings-in-django/
de: David Cramer von DISQUS hat eine ähnliche Lösung unter http://justcramer.com/2011/01/13/settings-in-django/ beschrieben
