Repository: Organice/django-organice
Catalog: docs/locale/*/LC_MESSAGES/overview.po
Languages: de

source: All-in-one collaboration solution. For non-profit organizations, sports clubs, small to medium-sized businesses.
de: Die Kollaborationslösung, die alles kann. Für Non-Profit-Organisationen, Sportvereine, kleine bis mittlere Unternehmen.

source: django Organice is a nice way to run a collaboration platform, an intranet, and websites for your business. It's a compilation of the best Django packages, preconfigured for getting you started quickly. Being powered by the well-known `Django Web framework`_ it's a safe choice for your IT investment providing an easily extensible architecture.
de: Mit django Organice gehen Sie den angenehmen Weg, eine Kollaborationsplatform, ein Intranet und Websites für Ihr Geschäft zu betreiben. Es ist eine Zusammenstellung der besten Django-Pakete, vorkonfiguriert, damit Sie sofort durchstarten können. Mit dem bekannten `Django Web framework`_ unter der Motorhaube haben Sie sich für eine sichere Wahl in Ihrem IT-Investment entschieden, das über eine leicht erweiterbare Architektur verfügt.

source: Fundamental Features
de: Grundsätzliche Features

source: Enables everyone to contribute to your content---while retaining your full control.
de: Befähigt jeden, zu Ihren Inhalten etwas beizutragen -- während Sie die vollständige Kontrolle bewahren.

source: Supports all four common collaboration and support patterns in several ways:
de: Unterstützt alle vier gängigen Kollaborations- und Support-Muster auf mehrere Wege:

source: *Active contribution* (create content, contribute corrections)
de: *Aktive Mitarbeit* (Inhalte erstellen, Korrekturen beisteuern)

source: *Passive contribution* (report issues, assign tasks, provide feedback)
de: *Passive Mitarbeit* (Probleme melden, Aufgaben zuweisen, Feedback geben)

source: *Active consumption* (search and browse for content)
de: *Aktiver Konsum* (Suchen und Durchstöbern von Inhalten)

source: *Passive consumption* (subscribe to notifications)
de: *Passiver Konsum* (Abonnieren von Benachrichtigungen)

source: Continually involves, helps and optimally supports your collaborators by sending out reminders, editing and submission hints to avoid losing traction or interest.
de: Involviert nachhaltig, hilft und unterstützt Sie bei der Zusammenarbeit optimal durch Aussenden von Erinnerungsmails, Bearbeitungs- und Einreichungshinweisen, damit Ihre Benutzer nicht Motivation und Interesse verlieren.

source: Core Components
de: Kernkomponenten

source: Major components of django Organice are:
de: Wesentliche Komponenten von django Organice sind:

source: full-featured content management (django CMS)
de: leistungsstarkes Content Management (django CMS)

source: full-featured versatile blog (Zinnia, cmsplugin)
de: leistungsstarker, vielseitiger Blog (Zinnia, cmsplugin)

source: events with event calendar (via Zinnia)
de: Veranstaltungskalender (via Zinnia)

source: flexible contact pages (cmsplugin)
de: flexibles Kontaktformular (cmsplugin)

source: link collection pages
de: Seiten für Linksammlungen

source: full-featured newsletter (Emencia)
de: leistungsstarker Newsletter (Emencia)

source: todo/issue lists
de: Todo-Listen, Aufgabenlisten

source: social login and user profiles (allauth)
de: Social Login und Benutzerprofile (allauth)

source: generic analytics support (analytical)
de: Generischer Analytics-Support (analytical)

source: web analytics respecting your privacy (Piwik integration)
de: Web Analytics, die Ihre Privatsphäre respektiert (Piwik-Integration)

source: multiple themes (available for free at http://organice.io/themes)
de: Zahlreiche Web-Themes (kostenlos verfügbar unter http://organice.io/themes)

source: multi-language support
de: Mehrsprachenfähigkeit

source: multiple websites support
de: Multi-Websitefähigkeit

source: database support for PostgreSQL, MySQL, Oracle, and more
de: Datenbankunterstützung für PostgreSQL, MySQL, Oracle u.v.m.

source: We are thrilled to get these awesome features out to you:
de: Wir können es kaum erwarten, Ihnen diese Features zu liefern:

source: group spaces with automatic mailing list (groupname@example.com)
de: Gruppenfunktionalität mit automatischem Mailverteiler (groupname@example.com)

source: documentation area / wiki (probably by use of CMS functionality)
de: Dokumentationsbereich / Wiki (möglicherweise mittels CMS-Funktionalität)

source: discussion forum / Q&A board (Askbot, Misago)
de: Diskussionsforum / Q&A-Board (Askbot, Misago)

source: content download for magazine generation
de: Herunterladen von Inhalten zum Genierieren von Print-Magazinen

source: unobtrusive, integrated, transparent document and asset management
de: unaufdringliches, integriertes, transparentes Dokumenten- und Asset-Management

source: fully integrated search (Haystack)
de: voll integrierte Suche (Haystack)

source: live chat or chat integration
de: Live-Chat oder Chat-Integration

source: surveys (django-crowdsourcing, ntusurvey)
de: Umfragen (django-crowdsourcing, ntusurvey)

source: Who is using django Organice?
de: Wer benutzt django Organice?

source: Examples of websites running django Organice:
de: Beispiele von Websites, die auf django Organice laufen:

source: `Organice demo site <http://demo.organice.io/>`_
de: `Organice Demo-Website <http://demo.organice.io/>`_

source: `Kreuzlingen Rudolf Steiner school <http://www.rssk.ch/>`_
de: `Rudolf Steiner Schule Kreuzlingen <http://www.rssk.ch/>`_

source: Download and Contributions
de: Downloads und Mitarbeit

source: Official repositories: (kept in sync)
de: Offizielle Repositories: (synchronisiert)

source: Getting Help
de: Hilfe holen

source: Documentation is available at http://docs.organice.io
de: Dokumentation ist verfügbar unter http://docs.organice.io

source: Questions? Please use `StackOverflow`_. Tag your questions with ``django-organice``.
de: Fragen? Bitte verwenden Sie `StackOverflow`_. Markieren Sie Ihre Fragen mit ``django-organice``.

source: Found a bug? Please use either the `Bitbucket`_ or `GitHub`_ issue tracker (you choose)
de: Haben Sie einen Bug gefunden? Verwenden Sie bitte entweder den `Bitbucket`_ oder `GitHub`_ Issue Tracker (freie Wahl)

source: Need support? You're welcome to use our `Gitter chat room`_.
de: Brauchen Sie Unterstützung? Unser `Gitter chat room`_ steht Ihnen gerne zur Verfügung.
